/*******************************************************************************
 * Filename   : Task_Handler.h
 * Project    : 
 * Created on :
 * Author(s)  : 
 * 
 * Date of last Modification:
 * by $Author$:
 * 
 * Description: 
 *
 * Compiler info : MPLABX XC16 Version 1.5
 * Processor info: 
 *
 ******************************************************************************/

/******************************************************************************
                                Include Files
*******************************************************************************/
#include "Include_headers.h"

/******************************************************************************
                             Variable Declaration
*****************************************************************************/
//Control Status Flags
typedef union {
    unsigned int i16[4];
    struct {
        //0
        unsigned Tsk_200uS:1;
        unsigned :1;
        unsigned :1;
        unsigned :1;
        unsigned :1;
        unsigned :1;
        unsigned :1;
        unsigned :1;
        unsigned :1;
        unsigned :1;
        unsigned :1;
        unsigned :1;
        unsigned :1;
        unsigned :1;
        unsigned :1;
        unsigned :1;
        //1
        unsigned Tasks_1mS:8;
        unsigned Tasks_10mS:8;
        
        //2
        unsigned Tasks_100mS:8;
        unsigned AC_Tasks:8;
        
        //3
        unsigned :16;
    };
}FLAG_STA;
extern FLAG_STA Control;

typedef struct
{
    unsigned int VPeak_Temp;
    unsigned int IPeak_Temp;
    unsigned int Count;
}VinVoltage;
extern VinVoltage Vin_Mon;

//Primary Data
typedef union {
    unsigned int i16[80];
    unsigned char i8[160];
    struct{//Integer 
        // Main Data - 21 Words
        unsigned int STATUS1;                   //0
        unsigned int STATUS2;                   //1
        unsigned int ALA_STAT;                  //2
        unsigned int ALA_LATCH;                 //3
        unsigned int VRMS_Avg;                  //4
        unsigned int IRMS_Avg;                  //5
        unsigned int PIN_Avg;                   //6
        unsigned int DC_BULK;                   //7
        unsigned int T_PFCFET_A;             //8
        unsigned int T_PFCFET_B;             //9
        unsigned int T_BOOSTDIODE;            //10
        unsigned int FREQ_PF;                   //11
        unsigned int VRMS_Inst;                 //12
        unsigned int IRMS_Inst;                 //13
        unsigned int PIN_Inst;                  //14
        unsigned int BL_STATUS;                 //15
        unsigned int REV;                  //16 modified unsigned int Microchip reference_REV;
        unsigned int CIS_REV;                   //17
        unsigned int RES_1;                     //18
        unsigned int RES_2;                     //19
        unsigned int RES_3;                     //20
        
        //Debug Data 's 12 Words
        unsigned int VRms_ADC;                  //21
        unsigned int IRms_ADC;                  //22
        unsigned int PIN_Rms_ADC;               //23
        unsigned int VRMS_ADC_Avg;              //24
        unsigned int IRMS_ADC_Avg;              //25
        unsigned int PIN_ADC_Avg;               //26
        unsigned int VIN_PEAK_ADC;              //27
        unsigned int IIN_PEAK_ADC;              //28
        unsigned int BULK_ADC_AVG;              //29
        unsigned int D_Data[3];                 //30 - 32
        
        //Cal Data 's 32 - 76
        unsigned int VIN_LL_Gain;               //33    
        unsigned int VIN_HL_Gain;               //34
        unsigned int VIN_Div;                   //35
                
        unsigned int IIN_LL_1A_Gain;            //36 - 53
        unsigned int IIN_LL_1A_ADC;             //  
        unsigned int IIN_LL_1A_Val;             //  
        unsigned int IIN_LL_4A_Gain;            //  
        unsigned int IIN_LL_4A_ADC;             //  
        unsigned int IIN_LL_4A_Val;             //  
        unsigned int IIN_LL_10A_Gain;           //  
        unsigned int IIN_LL_10A_ADC;            //  
        unsigned int IIN_LL_10A_Val;            //  
        unsigned int IIN_HL_0A5_Gain;           //  
        unsigned int IIN_HL_0A5_ADC;            //  
        unsigned int IIN_HL_0A5_Val;            //  
        unsigned int IIN_HL_2A_Gain;            //   
        unsigned int IIN_HL_2A_ADC;             //  
        unsigned int IIN_HL_2A_Val;             //  
        unsigned int IIN_HL_5A_Gain;            //  
        unsigned int IIN_HL_5A_ADC;             //  
        unsigned int IIN_HL_5A_Val;             //  
         
        unsigned int PIN_LL_1A_Gain;            //54 - 71
        unsigned int PIN_LL_1A_ADC;             //  
        unsigned int PIN_LL_1A_Val;             //  
        unsigned int PIN_LL_4A_Gain;            //  
        unsigned int PIN_LL_4A_ADC;             //  
        unsigned int PIN_LL_4A_Val;             //  
        unsigned int PIN_LL_10A_Gain;           //  
        unsigned int PIN_LL_10A_ADC;            //  
        unsigned int PIN_LL_10A_Val;            //  
        unsigned int PIN_HL_0A5_Gain;           //  
        unsigned int PIN_HL_0A5_ADC;            //  
        unsigned int PIN_HL_0A5_Val;            //  
        unsigned int PIN_HL_2A_Gain;            //  
        unsigned int PIN_HL_2A_ADC;             //  
        unsigned int PIN_HL_2A_Val;             //  
        unsigned int PIN_HL_5A_Gain;            //  
        unsigned int PIN_HL_5A_ADC;             //  
        unsigned int PIN_HL_5A_Val;             //          
        
        unsigned int BULK_GAIN;                 //72
        unsigned int CAL_RES1;                  //73          
        unsigned int CAL_RES2;                  //74
        
        unsigned int IIN_Div;                   //75
        unsigned int PIN_Div;                   //76    
        unsigned int BULK_DIV;                  //77           
        
        unsigned int CAL_RES3;                  //78    
        unsigned int CAL_LOCK_KEY;              //79         
        unsigned int CAL_DATA_CRC;              //80
    };
    struct{//Bits
        //Status1 - 0
        unsigned Startup:1;
        unsigned AC_OK:1;
        unsigned BULK_OK:1;
        unsigned Relay_Start:1;

        unsigned Relay_PWM_ON:1;
        unsigned PFC_GO:1;
        unsigned PFC_En:1;
        unsigned Sec_CMD_PFC_Dis:1;
        
        unsigned Sec_CMD_Droop_En:1;
        unsigned VHVDC_IN:1;
        unsigned VAC_Range_LL:1;

        unsigned Eep_Wr_Sta:1;
        unsigned Cal_CRC_Err:1;
        unsigned Cal_Unlock_Sta:1;                      //0 - Disabled , 1 = Enabled
        unsigned Flash_Wr_Sta:2;

         //Status2 -  Digital PFC Status bits
        unsigned CL_1st_PASS:1;
        unsigned CL_SoftStart:1;
        unsigned FF_Boost_1:1;
        unsigned Bulk_High_Sta:1;

        unsigned Bulk_Range:4;
        
        unsigned VPOL:1;
        unsigned VPOL_1:1;
        unsigned VPOL_2:1;
        unsigned New_AC_Data:1;
        
        unsigned Start_AC_Calc:1;
        unsigned :1;
        unsigned :1;
        unsigned :1;
        
        //Alarm - 2
        unsigned A_AC_Dropout:1;
        unsigned A_AC_IUV:1;            //Instant UV
        unsigned A_AC_IOV:1;            //Instant OV
        unsigned A_AC_Sag:1;
        unsigned A_AC_OV:1;             //Cycle RMS OV    
        unsigned :1;
        unsigned A_ALERT_PFC:1;          //Alert to Control Loop  
        unsigned A_ALERT_SEC:1;          //Alert to Secondary Side for PG requirements
        unsigned A_AC_UVW:1;
        unsigned A_AC_OVW:1;
        unsigned A_AC_OCW:1;
        unsigned A_AC_OPW:1;
        unsigned A_BULK_UV1:1;
        unsigned A_BULK_UV2:1;
        unsigned A_BULK_OV_ALERT:1;
        unsigned A_BULK_OVP:1;
        
        //Alarm Latch - 3
        unsigned :16;
        
        //4 - 7
        unsigned :16;
        unsigned :16;
        unsigned :16;
        unsigned :16;
        
        //8 - 19
        unsigned :16;
        unsigned :16;
        
        unsigned VIN_FREQ:8;
        unsigned VIN_PF:8;
        
        unsigned :16;
        unsigned :16;
        unsigned :16;
        unsigned :16;
        unsigned :16;        
        unsigned :16;
        unsigned :16;
        unsigned :16;
        unsigned :16;
        
        //20 - 35
        unsigned :16;
        unsigned :16;
        unsigned :16;
        unsigned :16;
        unsigned :16;
        unsigned :16;
        unsigned :16;
        unsigned :16;
        unsigned :16;
        unsigned :16;
        unsigned :16;
        unsigned :16;
        unsigned :16;
        unsigned :16;
        unsigned :16;
        unsigned :16;
                
        //36 - 38 - VCAL Data
        unsigned :16;        
        unsigned :16;
        unsigned :16;
        
        //39 - 41 - IIn PIN Div Data
        unsigned :16;
        unsigned :16;
        unsigned :16;
        
        //42 - 50 - IIN LL Cal Data
        unsigned :16;
        unsigned :16;
        unsigned :16;
        unsigned :16;
        unsigned :16;
        unsigned :16;
        unsigned :16;
        unsigned :16;
        unsigned :16;
        
        //51 - 59 - IIN HL Cal Data
        unsigned :16;
        unsigned :16;
        unsigned :16;
        unsigned :16;
        unsigned :16;
        unsigned :16;
        unsigned :16;
        unsigned :16;
        unsigned :16;
        
                
        //60 - 68 - PIN LL Cal Data
        unsigned :16;
        unsigned :16;
        unsigned :16;
        unsigned :16;
        unsigned :16;
        unsigned :16;
        unsigned :16;
        unsigned :16;
        unsigned :16;
        
        //69 - 77 - PIN HL Cal Data
        unsigned :16;
        unsigned :16;
        unsigned :16;
        unsigned :16;
        unsigned :16;
        unsigned :16;
        unsigned :16;
        unsigned :16;
        unsigned :16;
        
        //78 - 79 - Bulk CAL Data
        unsigned :16;        
        unsigned :16;
    };
}PRIMARY_DATA;
extern PRIMARY_DATA PRI_DATA;

//AC ALARM Variables
extern unsigned int Dropout_Delay;

//Bus Control
extern unsigned int Vbus_Ref[5];
extern signed int VbusRef,VRefRead;

//For Control Loop
extern signed int Vavg_Inv_Sq;

//EEPROM Write
extern unsigned int Eep_Cntl_State;
typedef union 
{
    unsigned int i16[48];
    unsigned char i8[96];
}CAL_DATA_BUFFER;
extern CAL_DATA_BUFFER Cal_Data_Buf;

//Power Metering
typedef struct
{
    unsigned int Sample_Cnt_Tmp;
    unsigned long long Vin_Sum_Tmp;
    unsigned long long Iin_Sum_Tmp;
    unsigned long long Pin_Sum_Tmp;
    
    unsigned int Sample_Cnt;
    unsigned long long Vin_Sum;
    unsigned long long Iin_Sum;
    unsigned long long Pin_Sum;
    
    unsigned int Sample_Cnt2;
    unsigned long long Vin_Sum2;
    unsigned long long Iin_Sum2;
    unsigned long long Pin_Sum2;
    
    unsigned long VRms_Sum;
    unsigned long IRms_Sum;
    unsigned long PRms_Sum;
    unsigned long VRms_ADC_Sum;
    unsigned long IRms_ADC_Sum;
    unsigned long PRms_ADC_Sum;
    unsigned int Rms_Avg_Count;    
}POWER_METER;
extern POWER_METER Pmeter;

extern unsigned int Vbus;
extern unsigned int Vin;
extern unsigned int Iin; 
extern unsigned int PfcPeriod;
extern unsigned int PfcPeriodBase;
extern signed long Max_u0_i;

//Future Variables
typedef union{
    unsigned int i16[32];
    unsigned char i8[64];
    struct{
        unsigned :16;       //0
        unsigned :16;       //2
        unsigned :16;       //4
        unsigned :16;       //6

        unsigned :16;       //8
        unsigned :16;       //10
        unsigned :16;       //12
        unsigned :16;       //14

        unsigned :16;       //16
        unsigned :16;       //18
        unsigned :16;       //20
        unsigned :16;       //22

        unsigned :16;       //24
        unsigned :16;       //26
        unsigned :16;       //28
        unsigned :16;       //30
        
        //Second Group
        unsigned :16;       //0
        unsigned :16;       //2
        unsigned :16;       //4
        unsigned :16;       //6

        unsigned :16;       //8
        unsigned :16;       //10
        unsigned :16;       //12
        unsigned :16;       //14

        unsigned :16;       //16
        unsigned :16;       //18
        unsigned :16;       //20
        unsigned :16;       //22

        unsigned :16;       //24
        unsigned :16;       //26
        unsigned :16;       //28
        unsigned :16;       //30
    };
}ADD_VARIABLES;
extern ADD_VARIABLES VAR;
/** IIR filter structure, used in AC-RMS and DC-Notch filtering */
/*
typedef struct IIR_lowpass_int
{
	int16_t a1[3];				//< Filter numerator coefficients, section 1. Q format. 
	int16_t b1[3];				//< Filter denominator coefficients, section 1. Q format.
	int32_t vbus_filter[3];			//< Intermediate calculation, section 1. 
	int16_t a2[3];				//< Filter numerator coefficients, section 2. Q format.
	int16_t b2[3];				//< Filter denominator coefficients, section 2. Q format.
	int32_t Qvbus[3];				//< Intermediate calculation, section 2. 
	int32_t output1;			//< Output of the filter, section 1. 
	int32_t output;				//< Output of the filter. Q format 

	int32_t calc11;				//< Intermediate calculation for section 1
	int32_t calc21;				//< Intermediate calculation for section 1 
	int32_t calc12;				//< Intermediate calculation for section 2 
